Revit 2027 API
ACADExportOptions.ACAPreference Property
 The preferred way to generate geometry of ACA objects. Default value is ACAObjectPreference.Object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ACAObjectPreference ACAPreference { get; set; }
Public Property ACAPreference As ACAObjectPreference
	Get
	Set
public:
property ACAObjectPreference ACAPreference {
	ACAObjectPreference get ();
	void set (ACAObjectPreference value);
}
member ACAPreference : ACAObjectPreference with get, set
Property Value
ACAObjectPreference
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace